Repository: quarkusio/ja.quarkus.io
Catalog: l10n/po/*/_guides/deploying-to-heroku.adoc.po
Languages: to

source: In this guide you will learn how to deploy a Quarkus based web application as a web-dyno to Heroku.
to: このガイドでは、QuarkusベースのWebアプリケーションをweb-dynoとしてHerokuにデプロイする方法を説明します。

source: This guide covers:
to: このガイドでは以下をカバーしています:

source: Update Quarkus HTTP Port
to: QuarkusのHTTPポートの更新

source: Install the Heroku CLI
to: Heroku CLIのインストール

source: Deploy the application to Heroku
to: アプリケーションのHerokuへのデプロイ

source: Deploy the application as Docker image to Heroku
to: アプリケーションをDockerイメージとしてHerokuにデプロイ

source: Deploy the native application as Docker image to Heroku
to: ネイティブアプリケーションをDockerイメージとしてHerokuにデプロイ

source: Prerequisites
to: 前提条件

source: For this guide you need:
to: このガイドでは以下が必要です。

source: Roughly 1 hour for all modalities
to: すべての手順を試すのに約1時間

source: https://www.heroku.com/[A Heroku Account]. Free accounts work.
to: link:https://www.heroku.com/[Herokuのアカウント]。無料のアカウントが使えます。

source: https://devcenter.heroku.com/articles/heroku-cli[Heroku CLI installed]
to: link:https://devcenter.heroku.com/articles/heroku-cli[Heroku CLIのインストール]

source: Introduction
to: はじめに

source: Heroku is a platform as a service (PaaS) that enables developers to build, run, and operate applications entirely in the cloud. It supports several languages like Java, Ruby, Node.js, Scala, Clojure, Python, PHP, and Go. In addition it offers a container registry that can be used to deploy prebuilt container images.
to: Herokuは、開発者がアプリケーションの構築、実行、運用をすべてクラウド上で行うことができるPaaS（Platform as a Service）です。Herokuは、Java、Ruby、Node.js、Scala、Clojure、Python、PHP、Goなどの言語をサポートしています。さらに、あらかじめ構築されたコンテナイメージを展開するためのコンテナレジストリも提供しています。

source: Heroku can be used in different ways to run a Quarkus application:
to: Herokuは、Quarkusのアプリケーションを実行するためにさまざまな方法で使用できます。

source: As a plain Java program running in a container defined by Heroku's environment
to: Herokuの環境で定義されたコンテナ内で動作するプレーンなJavaプログラムとして

source: As a containerized Java program running in a container defined by the Quarkus build process
to: Quarkusのビルドプロセスで定義されたコンテナ内で実行されるコンテナ化されたJavaプログラムとして

source: As a containerized native program running in a container defined by the Quarkus build process
to: Quarkusのビルドプロセスで定義されたコンテナ内で実行されるコンテナ化されたネイティブプログラムとして

source: All three approaches need to be aware of the port that Heroku assigns to it to handle traffic. Luckily, there's a dynamic configuration property for it.
to: この3つのアプローチはいずれも、トラフィックを処理するためにHerokuが割り当てるポートを意識する必要があります。幸運なことに、そのための動的な設定プロパティがあります。

source: The guide assumes that you have the https://devcenter.heroku.com/articles/heroku-cli[Heroku CLI] installed.
to: このガイドでは、 link:https://devcenter.heroku.com/articles/heroku-cli[Heroku CLI]がインストールされていることを前提としています。

source: Common project setup
to: プロジェクトの共通設定

source: This guide will take as input an application developed in the link:getting-started[Getting Started guide].
to: このガイドでは、 link:getting-started[入門ガイド] で開発されたアプリケーションを入力として使用します。

source: Make sure you have the getting-started application at hand, or clone the Git repository: `git clone {quickstarts-clone-url}`, or download an {quickstarts-archive-url}[archive]. The solution is located in the `getting-started` directory.
to: 手元に get-started アプリケーションがあることを確認するか、Git リポジトリをクローンします: `git clone {quickstarts-clone-url}` 、もしくは {quickstarts-archive-url}[archive] をダウンロードしてください。ソリューションは `getting-started` ディレクトリーにあります。

source: Or, just generate a fresh project:
to: あるいは、新しいプロジェクトを立ち上げることもできます。

source: Heroku can react on changes in your repository, run CI and redeploy your application when your code changes. Therefore we start with a valid repository already.
to: Herokuは、リポジトリの変更に反応し、CIを実行し、コードが変更されたときにアプリケーションを再デプロイすることができます。したがって、私たちはすでに有効なリポジトリから始めます。

source: Also, make sure your Heroku CLI is working:
to: また、Heroku CLIが動作していることを確認してください。

source: Prepare the Quarkus HTTP Port
to: QuarkusのHTTPポートの準備

source: Heroku picks a random port and assigns it to the container that is eventually running your Quarkus application. That port is available as an environment variable under `$PORT`. The easiest way to make Quarkus in all deployment scenarios aware of it is using the following configuration:
to: Herokuはランダムにポートを選択し、最終的にQuarkusアプリケーションを実行するコンテナに割り当てます。このポートは、 `$PORT` の環境変数として利用できます。すべての導入シナリオでQuarkusにそれを認識させる最も簡単な方法は、以下の設定を使用することです。

source: This reads as: "Listen on `$PORT` if this is a defined variable, otherwise listen on 8080 as usual." Run the following to add this to your `application.properties`:
to: これは次のように読み取れます。"定義済の変数の場合、 `$PORT` をリッスンする。そうでなければ、通常通り8080でリッスンする" です。以下を実行して、これを `application.properties` に追加してください。

source: Deploy the repository and build on Heroku
to: リポジトリのデプロイとHerokuでのビルド

source: The first variant uses the Quarkus Maven build to create the _quarkus-app_ application structure containing the runnable "fast-jar" as well as all libraries needed inside Heroku's build infrastructure and then deploying that result, the other one uses a local build process to create an optimized container.
to: 1つ目は、QuarkusのMavenビルドを使用して、実行可能な "fast-jar "とHerokuのビルドインフラに必要なすべてのライブラリを含む _quarkus-app_アプリケーション構造を作成し、その結果をデプロイするもので、もう1つはローカルビルドプロセスを使用して最適化されたコンテナを作成するものです。

source: Two additional files are needed in your application's root directory:
to: アプリケーションのルートディレクトリには、2つの追加ファイルが必要です。

source: `system.properties` to configure the Java version
to: Javaのバージョンを設定する為に `system.properties`

source: `Procfile` to configure how Heroku starts your application
to: Herokuがアプリケーションを開始する方法を設定するために `Procfile`

source: Quarkus needs JDK 11, so we specify that first:
to: QuarkusはJDK 11を必要とするので、まずそれを指定します。

source: We will deploy a web application so we need to configure the type `web` in the Heroku `Procfile` like this:
to: 今回はWebアプリケーションをデプロイするので、Heroku `Procfile` でタイプ `web` を以下のように設定する必要があります。

source: Your application should already be runnable via `heroku local web`.
to: あなたのアプリケーションは、すでに `heroku local web` を通して実行可能になっているはずです。

source: Let's create an application in your account and deploy that repository to it:
to: 自分のアカウントでアプリケーションを作成し、そこにそのリポジトリをデプロイしてみましょう。

source: The application will have a generated name and the terminal should output that. `heroku open` opens your default browser to access your new application.
to: アプリケーションには生成された名前があり、ターミナルにはその名前が出力されるはずです。 `heroku open` は、新しいアプリケーションにアクセスするためにデフォルトのブラウザで開きます。

source: To access the REST endpoint via curl, run:
to: curlでRESTエンドポイントにアクセスするには、次のように実行します。

source: Of course, you can use the Heroku CLI to connect this repo to your GitHub account, too, but this is out of scope for this guide.
to: もちろん、Heroku CLIを使ってこのレポジトリをGitHubアカウントに接続することもできますが、これはこのガイドでは対象外です。

source: Deploy as container
to: コンテナとしてデプロイ

source: The advantage of pushing a whole container is that we are in complete control over its content and maybe even choose to deploy a container with a native executable running on GraalVM.
to: コンテナ全体をプッシュすることの利点は、その内容を完全にコントロールできることであり、GraalVM上で動作するネイティブな実行ファイルを持つコンテナをデプロイすることも可能です。

source: First, login to Heroku's container registry:
to: まず、Herokuのコンテナレジストリにログインします。

source: We need to add an extension to our project to build container images via the Quarkus Maven plugin:
to: Quarkus Mavenプラグインを使ってコンテナイメージを構築するために、プロジェクトにエクステンションを追加する必要があります。

source: The image we are going to build needs to be named accordingly to work with Heroku's registry and deployment. We get the generated name via `heroku info` and pass it on to the (local) build:
to: これからビルドするイメージは、Herokuのレジストリやデプロイメントと連携するために、適切な名前を付ける必要があります。 `heroku info` を通して生成された名前を取得し、それを（ローカル）ビルドに渡します。

source: With Docker installed, you can now push the image and release it:
to: Dockerがインストールされたので、イメージをプッシュしてリリースすることができます。

source: You can and should check the logs to see if your application is now indeed running from the container:
to: アプリケーションが実際にコンテナから実行されているかどうか、ログを確認することができますし、確認すべきです。

source: The initial push is rather big, as all layers of the image need to be transferred. The following pushes will be smaller.
to: イメージの全レイヤーを転送する必要があるため、最初のプッシュはかなり大きくなります。それ以降のプッシュは小さくなります。

source: The biggest advantage we take when deploying our app as a container is to deploy a container with the natively compiled application. Why? Because Heroku will stop or sleep the application when there's no incoming traffic. A native application will wake up much faster from its sleep.
to: アプリをコンテナとしてデプロイする際の最大のメリットは、ネイティブにコンパイルされたアプリを使ってコンテナをデプロイすることです。なぜか？なぜなら、Herokuは着信トラフィックがないときにアプリケーションを停止またはスリープさせるからです。ネイティブ・アプリケーションは、スリープ状態からより早く目覚めます。

source: The process is pretty much the same. We opt in to compiling a native image inside a local container, so that we don't have to deal with installing GraalVM locally:
to: プロセスはほとんど同じです。ここでは、ローカルコンテナ内でネイティブイメージをコンパイルすることを選択し、ローカルにGraalVMをインストールする必要がないようにしています。

source: After that, push and release again:
to: その後、もう一度プッシュし、リリースします。
